{"questions": {"245a5c5e-986b-4b7a-8021-4bb6640ce132": "1. What are the two big ideas aimed at scaling the power of LLMs during inference mentioned in the context?  \n2. How does the concept of reasoning in latent space relate to the efficiency of computation during inference?", "b8a7c746-1882-4d12-b25d-6d7dda0401dd": "1. What are the two big ideas aimed at scaling the power of LLMs during inference mentioned in the context?  \n2. How does the concept of reasoning in latent space relate to the efficiency of computation during inference?", "8c195482-ccb8-4b64-9207-53ac935b9fc3": "1. What is the significance of staying in the \"mind Palace\" of the Transformer instead of resolving back to token space?  \n2. What are the key concepts that need to be covered before demonstrating large reasoning models?", "4d504d3c-6b6c-4e60-a55a-a702630fb2cc": "1. What is the significance of staying in the \"mind Palace\" of the Transformer according to the context?\n2. What are the main topics that will be covered in the demos mentioned in the context?", "457f82a5-e58b-4a74-8487-d079b4bd5ef2": "1. What are the main topics being discussed in the session related to large reasoning models?\n2. How does the concept of continuous latent space relate to the approaches of coconut and recurrent depth?", "00114527-4f5b-4e5e-9785-6fedc062c00e": "1. What are the main topics being discussed in the session on large reasoning models?\n2. How does the concept of reasoning in continuous latent space relate to the approaches of coconut and recurrent depth?", "d4feed01-e849-4bb2-8ef2-c5988f48b65b": "1. What are the key concepts being discussed in relation to reasoning in continuous latent space?  \n2. How do the continuous Chain of Thought and recurrent depth approaches impact test time compute scaling?", "664ec690-2855-4d65-b8f3-843257556607": "1. What are the key concepts being discussed in relation to reasoning in continuous latent space?  \n2. How do the continuous Chain of Thought and recurrent depth approaches impact test time compute scaling?", "c2e0158b-9191-4e85-9aa7-8837128ed0de": "1. What are the key concepts being introduced in the discussion about reasoning and latent space?\n2. How does the new coconut Library relate to the approaches being demonstrated in the context?", "31717d68-4fac-4917-bddf-f8d5267d3e56": "1. What are the two main approaches being demonstrated in the context of reasoning and latent space?\n2. How does the new coconut Library fit into the discussion of test time compute scaling?", "ae62c50a-bacb-442e-9584-8d9cce147f42": "1. What is the relationship between latent space and natural language in the context of a Transformer architecture?\n2. How does the GPT style architecture process a sequence to predict the next token?", "6f1642dd-bf6a-4dce-aed1-281be0671957": "1. What is the relationship between latent space and natural language in the context of a Transformer architecture?\n2. How does the GPT style architecture process a sequence to predict the next token?", "7bd2a599-0eb2-4bc7-aa7f-bb66b67aa380": "1. How do long context language models (LLMs) process and compress large sequences of information into a single token?\n2. In what way can LLMs be conceptualized as giant compression algorithms in relation to their vocabulary size?", "c1533d6f-038d-4bfa-b5f5-d745ae762aee": "1. How do long context language models (LLMs) process and compress large sequences of information into a single token?\n2. In what way can LLMs be conceptualized as giant compression algorithms in relation to their vocabulary size?", "3690c027-fa79-4f3d-b3e9-e0a83c3fc06a": "1. What is the significance of the term \"tokenless reasoning\" in the context of the model's operation?\n2. How does the scaling hypothesis relate to the concept of going tokenless in reasoning?", "2af0e5bf-b04e-4770-afe7-d8b0f7da9c0b": "1. What is the significance of the term \"tokenless reasoning\" in the context of the model's operation?\n2. How does the concept of scaling relate to the idea of going tokenless in reasoning?", "32478f12-3f8a-450c-9c06-d637944d0b5d": "1. What does the term \"tokenless\" refer to in the context of scaling and model architecture?\n2. How does the looping process contribute to generating responses without resolving back to tokens?", "0978f31f-5589-4980-ae1f-a1100427903a": "1. What does the term \"tokenless\" imply in the context of scaling and model architecture?\n2. How does the looping process contribute to generating responses without resolving to token space?", "06cba2c8-c6c4-4687-9e10-0793ee888c52": "1. What is the role of the blackbox in the context of input and output processing?\n2. How does scaling the latent space within the blackbox contribute to improving responses?", "b3e26cc1-d3db-4bf0-a725-7d224e7b6ab6": "1. What is the role of the blackbox in the context of input and output processing?\n2. How does scaling the latent space within the blackbox contribute to improving responses?", "6de38d2c-0d65-409b-b6bb-36f1d7894e97": "1. What is the significance of having thousands of points in Laden space compared to being limited to 500,000 tokens in token space?\n2. How does the ability to represent every floating point number in each element of the dimension embedding contribute to the expressiveness of the model?", "97cf485a-7798-4775-9191-8d72372bb83a": "1. What is the significance of having thousands of points in Laden space compared to being limited to 500,000 tokens in token space?\n2. How does the ability to represent every floating point number in each element of the dimension embedding contribute to the expressiveness of the model?", "5c6fd23c-3314-490b-806a-16c27928d7c2": "1. How does the concept of a \"mind Palace\" relate to the process of thinking and imagination in the context provided?  \n2. What is the significance of the 32-bit representation mentioned in relation to floating point numbers in embedding representation?", "7904db9b-a97a-47da-bc9f-cbaec7c00be5": "1. How does the concept of a \"mind Palace\" relate to the process of imagining complex structures in a limited physical space?\n2. What is the significance of the 32-bit representation in the context of embedding representation and token space?", "f73b2a1d-c5ea-4c22-8c04-8b18cde7abb6": "1. What does the speaker mean by \"latent space\" in the context of human intuition and thought processes?\n2. Why does the speaker find it frustrating to resolve thoughts into \"token space\"?", "2cd42eba-38aa-44cb-a249-375380b14fce": "1. What does the speaker mean by \"latent space\" in the context of human intuition and thought processes?\n2. Why does the speaker find it frustrating to resolve thoughts into \"token space\"?", "06a29fb6-14f9-4873-b937-269e19361221": "1. What challenges do individuals face when trying to articulate ideas they intuitively understand?  \n2. How has the process of scaling in artificial neural networks evolved from multi-layer perceptrons to deep learning?", "2a2ce2d9-90c5-4669-8728-6e43231d65e8": "1. What challenges do individuals face when trying to articulate ideas that they intuitively understand?  \n2. How has the process of scaling in artificial neural networks evolved from multi-layer perceptrons to deep learning?", "8cd48a58-56f1-450c-89da-482d065a5d49": "1. What is the significance of pre-training in the context of artificial neural networks and deep learning?\n2. How has the focus shifted in recent discussions regarding training models in artificial intelligence?", "42489239-05dd-4b66-91d7-10ef8a891883": "1. What is the significance of pre-training in the context of artificial neural networks and deep learning?\n2. How has the focus shifted in recent discussions regarding training models in artificial intelligence?", "2682d531-eff5-4494-a083-22b4a4115e57": "1. What has been the recent focus in the field of machine learning, particularly regarding post-training and its significance compared to pre-training?  \n2. How has the concept of test time compute, as discussed in a Google paper from August last year, contributed to the understanding of post-training processes?", "28b8a5c4-530a-4583-9718-bd2e0c7de84a": "1. What has been the recent focus in the field of machine learning, particularly regarding post-training and its significance compared to pre-training?  \n2. How has the concept of test time compute, as discussed in a Google paper from August last year, contributed to the understanding of post-training processes?", "160de9fa-7d00-4134-b4cc-10d04a93361d": "1. What is the main idea presented in the Google paper from August regarding test time compute?\n2. How does the concept of test time compute relate to the way humans approach difficult problems?", "20150a0d-9185-414a-8e3a-9c63a8c8df8f": "1. What is the main idea presented in the Google paper from August regarding test time compute?\n2. How does the concept of test time compute relate to the way humans approach difficult problems?", "f4407ea5-d884-4dd8-80ac-033f134a3b75": "1. What is the significance of generating tokens during chains of thought in the context of deep seek one?\n2. How do reasoning and test time compute relate to each other according to the discussion?", "e94f7136-150b-48fd-8c3a-c1cbf3a4faea": "1. What is the significance of generating tokens during chains of thought in the context of deep seek one?\n2. How do reasoning and test time compute relate to each other according to the discussion?", "64919ed5-6c99-4d1b-baa6-c226597ab42f": "1. What is the primary distinction between System One machines and System Two machines as mentioned in the context?  \n2. How do agents contribute to the reasoning capabilities of System One machines according to the provided context?", "75984f4f-0ede-4b11-a8e5-40da13dd8aa5": "1. What is the primary distinction made between System One machines and System Two machines in the context of reasoning?\n2. How do agents contribute to the concept of test time compute in the context of enhancing reasoning capabilities?", "cec95ba4-d8c0-4bdd-b5ab-cfd35cf0bf32": "1. What methods are currently being used to stretch the system from one machine to another?\n2. Why is it considered the right time to explore the concept of latent space in the field?", "23d13c8b-c5bc-4daf-97c4-af54077aa796": "1. What methods are currently being used to stretch the system from one machine to another?\n2. Why is it considered the right time to explore the concept of latent space in the field?", "a3f2ca76-3c04-4a02-9b6a-a50871bde3de": "1. What historical context is referenced in relation to deep learning and MLPs in the discussion?\n2. What concerns are raised about the current state of pre-training in machine learning?", "9497aafa-667b-45af-b4cd-bd72ce530861": "1. What historical context is referenced in relation to deep learning and MLPs in the discussion?\n2. What concerns are raised about the current state of pre-training in machine learning?", "01c78c07-018e-43bf-9845-aab98be3dc1e": "1. What has changed in the time required for inference that allows for more progress to be made?  \n2. What challenges did participants face during the engineering boot camp in early 2024?", "e196972b-d9d8-4171-9d76-55ab77a96907": "1. What has changed in the time required for inference that allows for more progress to be made?  \n2. What challenges did participants face during the engineering boot camp in early 2024?", "ddc87aa2-3271-40cf-844c-a589b3633a0f": "1. What issues were people experiencing with streaming the token in early 2024?  \n2. How do agentic tools differ from traditional applications in the context of deep research?", "17120ddc-e98e-4a65-ba4d-e16862474296": "1. What issues were people experiencing with streaming the token in early 2024?  \n2. How do agentic tools contribute to tackling larger problems beyond single tasks in deep research?", "1f753d2f-b057-492c-8e3c-8eb8216b742c": "1. What is the significance of providing \"the brain itself\" in the context of engineering within LLMs?\n2. How do chain of thought techniques contribute to understanding the reasoning process in LLMs?", "dac37f2a-8097-4f82-a657-8ea5c6f2b06d": "1. What is the significance of providing \"the brain itself\" in the context of engineering within LLMs?\n2. How do chain of thought techniques contribute to understanding the reasoning process in LLMs?", "30cd2357-c882-4714-9dd4-4d4d00375b18": "1. What advancements in technology are mentioned as contributing to faster inference times in applications?  \n2. In what types of applications does response latency become less significant, according to the context?", "e95ea26f-7d9d-46f5-ab03-b52b048a0cd2": "1. What advancements in technology are mentioned as contributing to faster inference times in applications?  \n2. In what scenarios does the context suggest that response latency is not a significant concern?", "ea5bbd98-71c7-430c-b532-121ae1b9cff0": "1. What is the significance of the last hidden state of the LLM in relation to reasoning?\n2. How does the concept of latent space differ from language space in the context of the discussed models?", "895fcef4-a184-453d-a1ba-8aa1fe9709e7": "1. What is the significance of the last hidden state of the LLM in relation to reasoning?\n2. How does the concept of latent space differ from language space in the context of the discussed models?", "f4869e3b-b645-42ff-aff8-1fe2c83c8749": "1. What is meant by the terms \"hidden state,\" \"latent space,\" and \"embedding space\" in the context of reasoning models?\n2. How do the last hidden states function as input embeddings in a typical Chain of Thought reasoning model?", "ae457115-ce53-4b77-8b05-1f25b65524a2": "1. What is meant by the terms \"hidden state,\" \"latent space,\" and \"embedding space\" in the context of reasoning models?\n2. How do the last hidden states function as input embeddings in a typical Chain of Thought reasoning model?", "006cff05-a8d5-4ee4-8fdb-323df87a48bb": "1. What is the purpose of looping back to the input embeddings before generating the next token in the GPT-2 model?\n2. How does the GPT-2 model avoid compression when predicting the next token?", "969d677f-955c-497c-8ea6-f05c026571c4": "1. What is the purpose of looping back to the input embeddings before generating the next token in the GPT-2 model?\n2. How does the GPT-2 model avoid compression when predicting the next token?", "ae59c070-9568-4074-8bf8-0b7c1df66f3e": "1. What is the significance of using hidden state representations in the context of next token prediction in the GPT style decoder stack?  \n2. How do the beginning of thinking and end of thinking tokens contribute to the process of generating thinking tokens and explaining the Chain of Thought?", "a772f143-5c12-480f-a9ee-3ce339cc986e": "1. What is the significance of the beginning and end of thinking tokens in the context of the GPT style decoder stack?  \n2. Why is the approach of not applying a language modeling head on each hidden state described as a black box?", "bbda2871-0f28-4f39-aaa9-9786dc242b1d": "1. What is the significance of the \"last step\" mentioned in the context regarding token prediction in language modeling?\n2. How might the developments discussed in the context be beneficial for real products and industries by 2025?", "ec49e115-281b-4526-b387-b0552eee6988": "1. What is the significance of the \"last step\" mentioned in the context regarding token prediction in language modeling?\n2. How might the developments discussed in the context be beneficial for real products and industries in 2025?", "6b695759-8ff1-4b9b-b6ae-3f5178ca8ba3": "1. What is the significance of the recurrent depth approach mentioned in the context for future products in 2025?  \n2. How does the model improve its performance at test time according to the recurrent depth approach?", "58ed34e8-06d6-4445-9ce0-0532e1bdda48": "1. What is the significance of the recurrent depth approach mentioned in the context for future products in 2025?  \n2. How does the model improve its performance at test time according to the recurrent depth approach?", "27340ff7-9d49-4ec7-8aeb-1845d784e0bf": "1. What is the key insight from the paper regarding tasks that require different levels of reasoning?\n2. How does the proposed Transformer architecture utilize latent space during training?", "f7da494c-9edd-45f5-ab09-31e96bdbe794": "1. What is the key insight from the paper regarding tasks that require different levels of reasoning?\n2. How does the proposed Transformer architecture utilize latent space during training?", "9b5100d7-faba-4ddf-aaf0-1a6d87e3f86a": "1. What is the purpose of the Prelude block in the described architecture?\n2. How does the recurrent block contribute to the computation of the final latent state?", "00459670-9e1f-4732-82b1-fe8f852cb78f": "1. What is the purpose of the Prelude block in the described architecture?\n2. How does the recurrent block contribute to the computation of the final latent state?", "4a9e6866-39e3-45ac-9ea6-81e1c0090be0": "1. What is the purpose of labeling the Prelude and Koda in the architecture diagram?\n2. How does the configuration of recurrent blocks in parallel contribute to the overall design discussed in the context?", "ee24e40b-3a3a-4296-98f5-19f91d1d55d0": "1. What is the purpose of labeling the Prelude and Koda in the architecture diagram?\n2. How does the configuration of recurrent blocks in parallel contribute to the overall design discussed in the context?", "4b00451a-e53f-4180-90c7-8c1e1c875046": "1. What is the main idea discussed in the context regarding the use of tokens and recurrent depth?\n2. How does the recurrent depth approach differ from the previous methods like coconut?", "2cbf3210-3cc4-4339-a066-c33054c5b449": "1. How does the recurrent depth approach compare to the coconut method in terms of efficiency for tasks requiring less reasoning?\n2. What are the key takeaways regarding the differences between the recurrent depth approach and the coconut method?", "a8beb369-6714-46a5-9657-c15adb39ee44": "1. What are the two different approaches mentioned in the context regarding the use of the same process?\n2. How does the recurrent depth architecture differ from the coconut approach in terms of reasoning?", "b0785bbd-9722-409f-948f-22a3ffeea215": "1. What are the two different approaches mentioned in the context regarding the use of the same process?  \n2. How does the recurrent depth architecture differ from the coconut approach in terms of reasoning?", "90bafaee-0088-4b2f-9f8d-7074eb8512f5": "1. What are the two different approaches mentioned in the context regarding the same process?  \n2. Who released the research that is discussed in the context, and how does it differ from the recurrent depth approach?", "aad6b07b-b942-4fea-96e9-8c9b714b355e": "1. What are the two different approaches mentioned in the context regarding the process being discussed?  \n2. Who released the research that is mentioned in the context, and how does it differ from the work done by meta AI?", "1ea50c5a-981f-4dbe-b620-d529870ec80e": "1. What is the current status of the research being conducted at Lawrence Livermore regarding the discussed technology?\n2. How does the implementation process differ between the Coconut space and the recurrent depth piece mentioned in the context?", "875a8134-9c24-4e43-9adf-a9b10338b17d": "1. What is the current status of the research being conducted at Lawrence Livermore regarding the discussed technology?\n2. How does the implementation process differ between the Coconut space and the recurrent depth piece mentioned in the context?", "282886fc-94ed-4966-8cab-13a7f027d21a": "1. What is the significance of the beginning of thinking and end of thinking tokens in the context of recurrent depth?  \n2. How does the concept of thinking about a single token relate to the overall sequence in the discussion?", "de099b8b-bd04-42aa-b79d-7ede8b4e13fd": "1. What is the significance of the beginning of thinking and end of thinking tokens in the context of recurrent depth?\n2. How does the concept of thinking about a single token relate to the overall sequence in the discussion?", "116badef-4910-4846-8d22-1a1ea589b892": "1. What is the main idea behind recurrent depth as described in the context?\n2. How do the scaling tools mentioned in the context interact with each other?", "5c95c2f8-6d20-46ec-a2b7-779b5d8abc49": "1. What is the main idea behind recurrent depth as described in the context?\n2. How do the scaling tools mentioned in the context relate to each other in terms of their functionality?", "edd275e1-4bdc-4f68-bbf0-fcda08ba9e6c": "1. What is the proposed method for decoding outputs in the context provided?  \n2. How does the speaker compare the current design limitations to the concept of designing tools at the atomic level?  ", "bf82d537-5886-4ec9-aea9-296f53fa1303": "1. What is the proposed method for decoding outputs in the context provided?  \n2. How does the speaker compare the current design limitations to the concept of designing tools at the atomic level?", "625baaa4-cd67-4653-b6bf-cffc0f4930fc": "1. What are the different systems mentioned in the context, and how are they categorized?\n2. How does the concept of meta learning relate to the systems described in the context?", "ce33f104-dcc3-4d7e-b5b0-f090abab5c85": "1. What are the different systems mentioned in the context, and how are they categorized?\n2. How does the concept of meta learning relate to the systems described in the context?"}, "relevant_contexts": {"245a5c5e-986b-4b7a-8021-4bb6640ce132": ["80abb974-ad4c-43e4-b8ca-3bde2a77cdb7"], "b8a7c746-1882-4d12-b25d-6d7dda0401dd": ["80abb974-ad4c-43e4-b8ca-3bde2a77cdb7"], "8c195482-ccb8-4b64-9207-53ac935b9fc3": ["6284b5f7-9772-4869-8d59-b2759c057a33"], "4d504d3c-6b6c-4e60-a55a-a702630fb2cc": ["6284b5f7-9772-4869-8d59-b2759c057a33"], "457f82a5-e58b-4a74-8487-d079b4bd5ef2": ["7376e56b-56bd-4af6-82fa-e24c093305fc"], "00114527-4f5b-4e5e-9785-6fedc062c00e": ["7376e56b-56bd-4af6-82fa-e24c093305fc"], "d4feed01-e849-4bb2-8ef2-c5988f48b65b": ["448eb31f-1ee1-4bb1-9c26-861297301554"], "664ec690-2855-4d65-b8f3-843257556607": ["448eb31f-1ee1-4bb1-9c26-861297301554"], "c2e0158b-9191-4e85-9aa7-8837128ed0de": ["0743d407-01c1-4ee4-bf38-d94d7f7a88e6"], "31717d68-4fac-4917-bddf-f8d5267d3e56": ["0743d407-01c1-4ee4-bf38-d94d7f7a88e6"], "ae62c50a-bacb-442e-9584-8d9cce147f42": ["d6150d76-1951-4573-b944-df94b8b3f2b7"], "6f1642dd-bf6a-4dce-aed1-281be0671957": ["d6150d76-1951-4573-b944-df94b8b3f2b7"], "7bd2a599-0eb2-4bc7-aa7f-bb66b67aa380": ["22a8e11e-6cc3-4dc4-b95e-35c48d9be549"], "c1533d6f-038d-4bfa-b5f5-d745ae762aee": ["22a8e11e-6cc3-4dc4-b95e-35c48d9be549"], "3690c027-fa79-4f3d-b3e9-e0a83c3fc06a": ["e146d096-2f90-49ef-8308-4bd3df205572"], "2af0e5bf-b04e-4770-afe7-d8b0f7da9c0b": ["e146d096-2f90-49ef-8308-4bd3df205572"], "32478f12-3f8a-450c-9c06-d637944d0b5d": ["fed8a5a4-5fa7-4e7c-aa7d-3377f7c7e516"], "0978f31f-5589-4980-ae1f-a1100427903a": ["fed8a5a4-5fa7-4e7c-aa7d-3377f7c7e516"], "06cba2c8-c6c4-4687-9e10-0793ee888c52": ["191d3728-f39a-4995-aff1-479ec53519fa"], "b3e26cc1-d3db-4bf0-a725-7d224e7b6ab6": ["191d3728-f39a-4995-aff1-479ec53519fa"], "6de38d2c-0d65-409b-b6bb-36f1d7894e97": ["886bbd2c-7cca-4652-9612-a76bcfef99e3"], "97cf485a-7798-4775-9191-8d72372bb83a": ["886bbd2c-7cca-4652-9612-a76bcfef99e3"], "5c6fd23c-3314-490b-806a-16c27928d7c2": ["cb6e1424-13be-4c16-a077-e5982fb37fa8"], "7904db9b-a97a-47da-bc9f-cbaec7c00be5": ["cb6e1424-13be-4c16-a077-e5982fb37fa8"], "f73b2a1d-c5ea-4c22-8c04-8b18cde7abb6": ["c432e5d8-63f0-4046-ba47-4c00ee9428e8"], "2cd42eba-38aa-44cb-a249-375380b14fce": ["c432e5d8-63f0-4046-ba47-4c00ee9428e8"], "06a29fb6-14f9-4873-b937-269e19361221": ["382327a5-5b90-45a9-958f-d95b40c1503d"], "2a2ce2d9-90c5-4669-8728-6e43231d65e8": ["382327a5-5b90-45a9-958f-d95b40c1503d"], "8cd48a58-56f1-450c-89da-482d065a5d49": ["d5698f05-9df6-4129-bf35-8c4389a4c84c"], "42489239-05dd-4b66-91d7-10ef8a891883": ["d5698f05-9df6-4129-bf35-8c4389a4c84c"], "2682d531-eff5-4494-a083-22b4a4115e57": ["bada7b5e-a0ac-4510-89e3-16fcae1becc1"], "28b8a5c4-530a-4583-9718-bd2e0c7de84a": ["bada7b5e-a0ac-4510-89e3-16fcae1becc1"], "160de9fa-7d00-4134-b4cc-10d04a93361d": ["53066349-f07d-443a-aef5-02fdc7ce73fc"], "20150a0d-9185-414a-8e3a-9c63a8c8df8f": ["53066349-f07d-443a-aef5-02fdc7ce73fc"], "f4407ea5-d884-4dd8-80ac-033f134a3b75": ["cf275523-3255-42cc-b1c2-2d38222a8e6c"], "e94f7136-150b-48fd-8c3a-c1cbf3a4faea": ["cf275523-3255-42cc-b1c2-2d38222a8e6c"], "64919ed5-6c99-4d1b-baa6-c226597ab42f": ["fb97507f-1311-4ef6-8620-2a436b71915c"], "75984f4f-0ede-4b11-a8e5-40da13dd8aa5": ["fb97507f-1311-4ef6-8620-2a436b71915c"], "cec95ba4-d8c0-4bdd-b5ab-cfd35cf0bf32": ["a00fdc92-7319-4e07-824b-b3384c0d817e"], "23d13c8b-c5bc-4daf-97c4-af54077aa796": ["a00fdc92-7319-4e07-824b-b3384c0d817e"], "a3f2ca76-3c04-4a02-9b6a-a50871bde3de": ["dfba5be1-51cd-465e-be80-d2bd41471696"], "9497aafa-667b-45af-b4cd-bd72ce530861": ["dfba5be1-51cd-465e-be80-d2bd41471696"], "01c78c07-018e-43bf-9845-aab98be3dc1e": ["a6b36df0-6da1-430f-8034-9a65b5138b27"], "e196972b-d9d8-4171-9d76-55ab77a96907": ["a6b36df0-6da1-430f-8034-9a65b5138b27"], "ddc87aa2-3271-40cf-844c-a589b3633a0f": ["60ccb723-9637-4d5c-90b8-b63d6f4044e7"], "17120ddc-e98e-4a65-ba4d-e16862474296": ["60ccb723-9637-4d5c-90b8-b63d6f4044e7"], "1f753d2f-b057-492c-8e3c-8eb8216b742c": ["e5bab060-2af7-4dcd-ba99-f436c51725d0"], "dac37f2a-8097-4f82-a657-8ea5c6f2b06d": ["e5bab060-2af7-4dcd-ba99-f436c51725d0"], "30cd2357-c882-4714-9dd4-4d4d00375b18": ["ebab0617-5211-45bb-9c56-dd249c8143fb"], "e95ea26f-7d9d-46f5-ab03-b52b048a0cd2": ["ebab0617-5211-45bb-9c56-dd249c8143fb"], "ea5bbd98-71c7-430c-b532-121ae1b9cff0": ["ba187484-e1d3-494f-9b33-5dcfbcf24f8f"], "895fcef4-a184-453d-a1ba-8aa1fe9709e7": ["ba187484-e1d3-494f-9b33-5dcfbcf24f8f"], "f4869e3b-b645-42ff-aff8-1fe2c83c8749": ["ee78c32e-e4d4-4236-8d85-f86704312de2"], "ae457115-ce53-4b77-8b05-1f25b65524a2": ["ee78c32e-e4d4-4236-8d85-f86704312de2"], "006cff05-a8d5-4ee4-8fdb-323df87a48bb": ["cd1e0eb3-2a4c-41cb-bfa9-41f08db0d656"], "969d677f-955c-497c-8ea6-f05c026571c4": ["cd1e0eb3-2a4c-41cb-bfa9-41f08db0d656"], "ae59c070-9568-4074-8bf8-0b7c1df66f3e": ["3a0371e5-040c-4f24-a799-ba26aff55127"], "a772f143-5c12-480f-a9ee-3ce339cc986e": ["3a0371e5-040c-4f24-a799-ba26aff55127"], "bbda2871-0f28-4f39-aaa9-9786dc242b1d": ["d838212b-696c-4b01-9260-5893c28d9d2e"], "ec49e115-281b-4526-b387-b0552eee6988": ["d838212b-696c-4b01-9260-5893c28d9d2e"], "6b695759-8ff1-4b9b-b6ae-3f5178ca8ba3": ["ebbc96ae-cf77-412b-8dd1-08b5fb0e7b5a"], "58ed34e8-06d6-4445-9ce0-0532e1bdda48": ["ebbc96ae-cf77-412b-8dd1-08b5fb0e7b5a"], "27340ff7-9d49-4ec7-8aeb-1845d784e0bf": ["e2b1de1d-6d3e-4edb-b4b7-bca593a44b9f"], "f7da494c-9edd-45f5-ab09-31e96bdbe794": ["e2b1de1d-6d3e-4edb-b4b7-bca593a44b9f"], "9b5100d7-faba-4ddf-aaf0-1a6d87e3f86a": ["1ba91381-5fe9-4f5c-a310-7c2b38218207"], "00459670-9e1f-4732-82b1-fe8f852cb78f": ["1ba91381-5fe9-4f5c-a310-7c2b38218207"], "4a9e6866-39e3-45ac-9ea6-81e1c0090be0": ["670951c6-4b63-48a9-82db-d43512bbfeb3"], "ee24e40b-3a3a-4296-98f5-19f91d1d55d0": ["670951c6-4b63-48a9-82db-d43512bbfeb3"], "4b00451a-e53f-4180-90c7-8c1e1c875046": ["0a51141d-546a-461a-ad5c-a4ab234650c7"], "2cbf3210-3cc4-4339-a066-c33054c5b449": ["0a51141d-546a-461a-ad5c-a4ab234650c7"], "a8beb369-6714-46a5-9657-c15adb39ee44": ["fbc1100b-d806-4090-88b7-cd8a8011e398"], "b0785bbd-9722-409f-948f-22a3ffeea215": ["fbc1100b-d806-4090-88b7-cd8a8011e398"], "90bafaee-0088-4b2f-9f8d-7074eb8512f5": ["c44a13ee-3b19-438d-86cb-364d0ffcd29a"], "aad6b07b-b942-4fea-96e9-8c9b714b355e": ["c44a13ee-3b19-438d-86cb-364d0ffcd29a"], "1ea50c5a-981f-4dbe-b620-d529870ec80e": ["6db27107-5ae4-4a9c-89e3-319f9baedcc7"], "875a8134-9c24-4e43-9adf-a9b10338b17d": ["6db27107-5ae4-4a9c-89e3-319f9baedcc7"], "282886fc-94ed-4966-8cab-13a7f027d21a": ["aefef0a4-667c-40a7-ab22-19f4fcdd6b80"], "de099b8b-bd04-42aa-b79d-7ede8b4e13fd": ["aefef0a4-667c-40a7-ab22-19f4fcdd6b80"], "116badef-4910-4846-8d22-1a1ea589b892": ["d87795a3-19d2-412e-8c7c-0fd2431bf9df"], "5c95c2f8-6d20-46ec-a2b7-779b5d8abc49": ["d87795a3-19d2-412e-8c7c-0fd2431bf9df"], "edd275e1-4bdc-4f68-bbf0-fcda08ba9e6c": ["ae747c85-7f02-4425-aadf-0253125e3fa0"], "bf82d537-5886-4ec9-aea9-296f53fa1303": ["ae747c85-7f02-4425-aadf-0253125e3fa0"], "625baaa4-cd67-4653-b6bf-cffc0f4930fc": ["66c90907-4783-45c2-a156-b4edae39fc91"], "ce33f104-dcc3-4d7e-b5b0-f090abab5c85": ["66c90907-4783-45c2-a156-b4edae39fc91"]}, "corpus": {"80abb974-ad4c-43e4-b8ca-3bde2a77cdb7": "okay whiz we're talking about reasoning in latent space today is that the same as test time compute yeah that's right nice nice okay and we've got two big ideas to cover that are aimed at scaling the power of llms during inference is that right that yeah that's right so we have we have two you know latent space methods uh we have our continuous Chain of Thought or coconut right and then we have our more more directly more uh you know uh budget forcing recurrent depth uh model yes man that's a lot so when we look across both of those there appears to be a pretty simple explanation it's almost like uh you know when we when we're in that sort of thinking space of computation we don't have to do the thinky thinky in words and that's better maybe even it will allow us to find a new scaling axis is that right yeah that's exactly right I mean the idea is that we have this uh you know we we have this way of taking advantage of of uh the most powerful thinking space in the Transformer and not", "6284b5f7-9772-4869-8d59-b2759c057a33": "is that right yeah that's exactly right I mean the idea is that we have this uh you know we we have this way of taking advantage of of uh the most powerful thinking space in the Transformer and not just like for a second right not automatically resolving back to token space but kind of staying in this very like uh you know in in the mind Palace of the of the Transformer without having to write down the words yes okay okay okay so basically scaling is dead Long Live scaling something like that yeah scaling has died uh we should scale yeah all right all right all right well I'm pumped for the demos today we're going to see some thinking in latent space let's cover all the Concepts we need to get there we'll get you back in for some discussions along the way because this one's pretty meta thanks whiz all right guys we are gonna rock out on large reasoning models today while we were originally going to just cover chain of continuous thought or coconut we saw a paper come out a couple", "7376e56b-56bd-4af6-82fa-e24c093305fc": "thanks whiz all right guys we are gonna rock out on large reasoning models today while we were originally going to just cover chain of continuous thought or coconut we saw a paper come out a couple weeks ago on recurrent depth right along these same lines so what we're talking about today is reasoning in continuous Laten space that's the Common Thread we're going to try to grock what that means try to visualize it and then go build ship and share some awesome stuff with both coconut and the new recurrent depth approaches also we'll talk about implications of scaling and where all this is headed it connects back to test time compute and all the stuff we've been talking about in our lrm series if you have questions along the way please do put them in the slido link and we will up we will get to the most upvoted questions at the end of the sesh if you want to jump in on YouTube or on LinkedIn live and throw a comment in live please do during the discussions and join us in investigating", "448eb31f-1ee1-4bb1-9c26-861297301554": "to the most upvoted questions at the end of the sesh if you want to jump in on YouTube or on LinkedIn live and throw a comment in live please do during the discussions and join us in investigating this really cool new space all right with that let's go ahead and hop right into it guys today we're talking about reasoning in continuous latent space all right so we want to kind of wrap our head around all of these key words and this is a really really cool idea when we can finally start to grock it so I hope you guys are feeling as excited about it as I am by the end of the session ideally after this hour you spend with us you're going to understand reasoning in continuous Laten space including the continuous Chain of Thought or coconut and recurrent depth approaches we want to discuss the impact of this kind of approach on test time compute scaling some of the working hypotheses and some of the things people are interested in in looking out there on the llm edge for as we continue to", "0743d407-01c1-4ee4-bf38-d94d7f7a88e6": "impact of this kind of approach on test time compute scaling some of the working hypotheses and some of the things people are interested in in looking out there on the llm edge for as we continue to see the field progress I want to demonstrate both approaches and check out the new coconut Library as well so how we're going to go through this is we're going to essentially introduce this idea of reasoning and latent space then we're going to talk about the scaling part of this before we dig into the specific approaches and we get the demo on both approaches by the end so it should be a lot of fun today let's go ahead and dig in reasoning in latent space let's root ourselves first in some definitions when we talk about reasoning we're talking about the action of thinking about something and it's kind of funny in a logical way if you look up logic it uses the word reason and there we are caught in a loop but reasoning is about thinking latent space is about using a representation of our", "d6150d76-1951-4573-b944-df94b8b3f2b7": "it's kind of funny in a logical way if you look up logic it uses the word reason and there we are caught in a loop but reasoning is about thinking latent space is about using a representation of our data that sort of captures the essential features of it we can think of latent space as embedding space or the space of math and numbers in other words it's just not the space of words and natural language let's think about how this manifests in a Transformer architecture here I'm showing a GPT style architecture from the gpt2 paper what we want to think about is we want to put a sequence in and we want to get some next token prediction out when we put the sequence in we're in the space of natural language when we get the next token out we're in the space of natural language betwix in between we're going to be in latent space we're going to be in embedding space we're going to be in the space where we can do math and stuff and importantly we can kind of think that we're putting in this big", "22a8e11e-6cc3-4dc4-b95e-35c48d9be549": "going to be in latent space we're going to be in embedding space we're going to be in the space where we can do math and stuff and importantly we can kind of think that we're putting in this big old sequence you know especially if you think of these long context LMS we're just jamming context in there and then we're popping out one to one single token okay so really at the end of the day you can kind of think of this as we're kind of doing this compression okay we're taking all of this POS possibility space and all this crazy and then we're just like one token we just want one so it's kind of interesting to to think off the bat that llms in this sense are kind of giant compression algorithms we are condensing all of that information into one of Let's just call it 500,000 different tokens that we might have there are many different sizes of possible vocabulary but let's pick a pick a big number that is on the order of magnitude of something we might see hundreds of thousands here down", "e146d096-2f90-49ef-8308-4bd3df205572": "that we might have there are many different sizes of possible vocabulary but let's pick a pick a big number that is on the order of magnitude of something we might see hundreds of thousands here down to one now let's uh let's think about this a little bit more the model itself doesn't really need tokens okay we need the tokens the model is cool with just the compute space because it's a happening in a comp computer right and so for this reason you'll start to hear people talk about tokenless reasoning and this is the idea of reasoning in latent space we're sort of doing it without tokens and and the hypothesis here the scaling hypothesis you might say is that going tokenless can allow us to scale okay hold on let's discuss this hypothesis is uh come up for this one so going tokenless can allow us to scil uh that seems a little a little weird to me I'm not it's not very intuitive what's your intuition behind this yeah so I the word tokenless is a is a is a fun one I would say like the", "fed8a5a4-5fa7-4e7c-aa7d-3377f7c7e516": "allow us to scil uh that seems a little a little weird to me I'm not it's not very intuitive what's your intuition behind this yeah so I the word tokenless is a is a is a fun one I would say like the idea is we don't need to resolve back to tokens to scale because we can just keep looping around before we get to tokens right really anything that allows us to keep looping around until we get to The Final Answer uh is is g to allow us to scale right because we can say well Loop more Loop more Loop more right like uh W with with uh you know with say like generating a response right if I generate for five tokens versus if I generate for 70,000 tokens right like we we have this idea of a scaling axis on the on the inference side this is just kind of shoving that inside the uh the model architecture as opposed to allowing it to resolve to token space but the idea is we're still adding information at every step at every stage right that we do a a loop as it were so we're getting a better and", "191d3728-f39a-4995-aff1-479ec53519fa": "as opposed to allowing it to resolve to token space but the idea is we're still adding information at every step at every stage right that we do a a loop as it were so we're getting a better and better and better and better and better response okay okay okay so so I'm kind of imagining okay I have input I have output I have a blackbox in the middle and this sort of like scaling of the blackbox in the middle just in in this sort of you know latent space of the blackbox in the middle is is the latent space itself being scaled or or what is being scaled precisely if I look inside deeply that blackbox and that latent space is it is it that I'm just using uh a lot more of the latent space is that I you know bigger embedding models uh the intuition is a little bit tough for me um how does it come across for you and we will go into more detail you know uh throughout the presentation today yeah I mean like the big the big idea here right the the the the the the big fun thing is that we have", "886bbd2c-7cca-4652-9612-a76bcfef99e3": "across for you and we will go into more detail you know uh throughout the presentation today yeah I mean like the big the big idea here right the the the the the the big fun thing is that we have uh thousands and thousands and thousands and millions right of of of points on the line that we can exist in Laden space whereas we're like kind of owned by 500,000 tokens token space Oh uh you know like having having every every every floating Point number in every single element of the dimension embedding right uh can be expressed in Laden space so even if we only had you know like uh 20,000 numbers we could represent per element but we have 4,000 elements you do the math big number right so the more than 500,000 more than 500,000 certainly right okay okay we scaled it up at that point we've scaled it up we have more Nuance right we have like very slightly different as opposed to massively different right and this uh this allows us to be more expressive yes we have to get back to token", "cb6e1424-13be-4c16-a077-e5982fb37fa8": "scaled it up we have more Nuance right we have like very slightly different as opposed to massively different right and this uh this allows us to be more expressive yes we have to get back to token space right but while we're thinking while we're in the mind Palace it's like in your imagination right you can imagine the largest of buildings you could you could imagine yourself walking through a castle things like this right even though in your physical space you've got a pen and paper right it's like this is the this is the the idea okay okay so on the computer level we've got this 32-bit representation of yes of sort of each floating Point number in our embedding representation that's right and so that can just like okay we we're way above that that number of tokens that we might have off the bat okay and and then there's this there's a sort of human level sort of sort of intuition that I have which is like you know it's like a wait hold on let me think and when I'm frozen I'm not", "c432e5d8-63f0-4046-ba47-4c00ee9428e8": "off the bat okay and and then there's this there's a sort of human level sort of sort of intuition that I have which is like you know it's like a wait hold on let me think and when I'm frozen I'm not thinking in words I'm thinking somewhere in my latent space of my mind like I'm not thinking complete word thoughts I'm not going through that arduous next token prediction in my head I'm I'm kind of I'm kind of exploring all the possibility spaces and this is I think my intuition behind this Laten space idea and going tokenless is is we often do this you know you see people going tokenless in their Laten space reasoning compute in their mind when you talk to them right I mean and that's in fact we have to resolve thoughts to to token space all the time and it's it's incredibly frustrating right like when you when you when you're trying to describe an idea that you just don't have the words for but you intuitively in your mind you understand it well you're struggling to get it out to the", "382327a5-5b90-45a9-958f-d95b40c1503d": "like when you when you when you're trying to describe an idea that you just don't have the words for but you intuitively in your mind you understand it well you're struggling to get it out to the Token space it's the same thing in the obious anthropomorphizing a lot but the idea is there is a parallel to that process that exists in in the model that's right and how many times have students said I I I I know it I just can't tell you it yeah there it is there it is okay all right beautiful uh whiz thanks for your insights let's keep it moving uh so as we think about scaling what we want to do is we want to think about this idea of test time compute along with scaling in the stor in the way that we've gotten here scaling of course started you know way back in the day with the multi-layer perceptron artificial neural networks and single neurons to many neurons and so on but it really really got going with deep learning and we we saw we train bigger and bigger models we get better and", "d5698f05-9df6-4129-bf35-8c4389a4c84c": "perceptron artificial neural networks and single neurons to many neurons and so on but it really really got going with deep learning and we we saw we train bigger and bigger models we get better and better output and results this has been known for years and it's it's known even today I mean this is from the CEO of anthropic Dario amade and you know we want to think about the the the place that we are based on where we've been want to put this in context here so we go from pre-training which is the thing that sort of takes a long time it's the it's the show goth it's got all the possibilities we can sort of think of this as months many many tens of thousands of gpus maybe more these days and as we saw at nurs this past uh you know year Ilia suit noted that pre-training as we know it will end now we've seen that there's been a lot of focus subsequently especially you know out in public on posttraining and on this idea of rhf and RL we talked about this in our recent reasoning model", "bada7b5e-a0ac-4510-89e3-16fcae1becc1": "end now we've seen that there's been a lot of focus subsequently especially you know out in public on posttraining and on this idea of rhf and RL we talked about this in our recent reasoning model events and when we think about this post-training phase it continues to grow in scope and scale and it's been a real Focus area Beyond pre-training we sort of you see a lot of companies coming up like RC and others that are really really focused on this posttraining piece rather than on pre-training from scratch there are very few people it's almost been commoditized the pre-training from scratch so this phase of post-training is getting larger and larger and we see this coming to fruition and things like 01 where we'll do some of this posttraining RL rhf where we start dealing with these very long chains of thought and this is where this idea of test time compute came up and this was a paper from Google in August last year called scaling test time compute you know it's basically taking that", "53066349-f07d-443a-aef5-02fdc7ce73fc": "chains of thought and this is where this idea of test time compute came up and this was a paper from Google in August last year called scaling test time compute you know it's basically taking that scaling paper originally and saying well now we have this sort of other axis to scale on and again this is the idea that we're anthropomorphizing a little bit but humans tend to think longer on difficult problems maybe we should let machines do that and when we think of test time Compu it's just time spent thinking you know and so if we we think about kind of how we can leverage this we've seen some of these things come out in recent weeks and recent months we talked about deep seek R1 just last week and you know this is the same idea it thinks before it answers and this is again just sort of the next step in the evolution of what we've got going on here and we saw moreover deep seek one generates one token at a time it's able to spend more time processing and it generates these thinking", "cf275523-3255-42cc-b1c2-2d38222a8e6c": "the next step in the evolution of what we've got going on here and we saw moreover deep seek one generates one token at a time it's able to spend more time processing and it generates these thinking tokens that explain its Chain of Thought So we're generating tokens during our chains of thought and that makes them explainable very cool all right I want to bring whiz back up for just a moment here okay just to be super clear reasoning and test time compute do you think these are sort of you know triple equal sign or or how would you how would you say you know generally we're talking about the same thing but they're not the same thing yeah they're they're this so so okay they're not literally the same thing of course but they're also pretty much the same thing in in how we talk about it in 2025 today that's right that's right so so reasoning is some right now because our models are System One machines right this is the this is the they're not reasoners they're they're uh they're they're", "fb97507f-1311-4ef6-8620-2a436b71915c": "today that's right that's right so so reasoning is some right now because our models are System One machines right this is the this is the they're not reasoners they're they're uh they're they're just they they just do they just do they just do right uh we need some way to stretch them into this reasoning domain and the way that we do that is through some kind of test time computer some kind of test time scaling things that you know it's interesting to think about but something like an agent right is an example or expression of test time compute right we're we're we're using the agent to leverage more compute to do cooler things right so these kinds of systems are also test time compute uh very broad definition you love agents are also reasoning right that's right agents are reason there you go but the idea is that we we need some way to stretch the system one machine to a system two machine and the way that we know how to do that right now is is through these time compute methods", "a00fdc92-7319-4e07-824b-b3384c0d817e": "you go but the idea is that we we need some way to stretch the system one machine to a system two machine and the way that we know how to do that right now is is through these time compute methods where we spend more time on inference uh as opposed to changing the architecture doing more pre-training or etc etc yeah I like I like your caveats of that's what we're doing now let's zoom out a little bit here and let's let's you know these breakthroughs that we're seeing you know and they're just coming pre-training posttraining and now test time compute like when you look out and you look at the field and how it's merging I mean one of the things that is important to note as we as we dig into coconut next is it feels like it's the right time to dig into this latent space thing why is that why is this an obvious Next Step yeah this is we talked about this uh you know we prep for these events obviously it's not a surprise but we we talked about this kind of thing when we were prepping for", "dfba5be1-51cd-465e-be80-d2bd41471696": "is this an obvious Next Step yeah this is we talked about this uh you know we prep for these events obviously it's not a surprise but we we talked about this kind of thing when we were prepping for this event and I think the discussion was was good because it was we've been through this history so many times right like like with deep learning deep learning was a good idea the day we discovered MLPs which was which was ages ago right uh but then but we lacked the circumstance for for that that additional depth you know to be practically useful and it's the same thing now where we're we're we're coming up against a wall if you remember Ila's words right pre-training is dead uh not not really but we're running out data pre-training is it's slowing down it's plateau going right and the idea is that we have some idea we have some thoughts that that say well we need to keep progress going so what's the next lowest hanging fruit that is accommodated by our Hardware uh and that's why it's", "a6b36df0-6da1-430f-8034-9a65b5138b27": "is that we have some idea we have some thoughts that that say well we need to keep progress going so what's the next lowest hanging fruit that is accommodated by our Hardware uh and that's why it's like well we can just spend more time doing inference then right we we can we can do inference so fast now that spending extra time in inference isn't uh is feasible you know what would have used to take months or or or or at least weeks now can take you know a day or hours and so it makes sense you know the the the circumstances have changed uh we're running up against a a wall with our tried and true bread and butter methods uh and so now is the time for these you know for these kinds of uh leaps of progress yeah yeah and I remember you know when we were teaching like the a engineering boot camp and in early 2024 a lot of people were having you know issues with with streaming the token out and a lot of people were you know it's like it's like it just becomes so much easier to get you want", "60ccb723-9637-4d5c-90b8-b63d6f4044e7": "and in early 2024 a lot of people were having you know issues with with streaming the token out and a lot of people were you know it's like it's like it just becomes so much easier to get you want a quick result boom gbt 40 mini or whatever it is whatever equivalent of model are so good at those quick results those sort of system one results that now we're like okay what if we want to tackle bigger Beyond a single task kind of problems like we're seeing with deep research like we're seeing with these other things that require it to go chew on some things but I want to also just dig in there real quick because you mentioned agents and when we think about deep research or some of these types of tools they're actually agentic and they're using tools what we're talking about here is we're talking about reasoning inside the llm and we're talking about doing engineering within the llm and and sort of giving giving the sort of the brain itself instead of the application we're not giving the", "e5bab060-2af7-4dcd-ba99-f436c51725d0": "about reasoning inside the llm and we're talking about doing engineering within the llm and and sort of giving giving the sort of the brain itself instead of the application we're not giving the application cycle we like giving the brain itself Cycles to think here right um is that is that approximately you know where you see where we're at and then where do you see this headed you know at least for the rest of 2025 yeah that's exactly right I mean we we have we have time you know to spend because our inference is so fast so good uh and and we're and we're we're back to we're back to where we were before for right so llms are a blackbox we know that uh you know but these chain of thought things were really nice because we can see the thinking but now in order to get to the next stage of scaling right we kind of got to go a little bit more into the blackbox we gota go back beyond the unknown yeah it happens but it's it's it's it's the the timing is right and uh with companies like you", "ebab0617-5211-45bb-9c56-dd249c8143fb": "right we kind of got to go a little bit more into the blackbox we gota go back beyond the unknown yeah it happens but it's it's it's it's the the timing is right and uh with companies like you know Nvidia with companies the other accelerators that are that are coming out they're super good at inference Gro and S all these other peeps right uh we're getting real fast at inference and so the spending that time you know becomes less and less impactful to the user experience but more importantly uh you know we have a lot of applications LMS aren't good for yet where we don't care about response latency like research like uh PhD level math where it's like it doesn't matter if it takes a day yeah because that means it didn't take some some other person a day right like that's the that's the the we're at this time the models are capable enough that we can think about problems that we can't just do ourselves faster it the whole the whole you know ecosystem is set up for this to be the right", "ba187484-e1d3-494f-9b33-5dcfbcf24f8f": "we're at this time the models are capable enough that we can think about problems that we can't just do ourselves faster it the whole the whole you know ecosystem is set up for this to be the right time to push reason oh man okay all right there's so many rabbit holes let's avoid them and let's keep it moving thanks whiz for your insights on that as as well let's get into coconut guys let's talk about how this actually manifests itself again big idea um you know we can start at the very high level we can say this is about latent space it's not about language space okay this is about and this is exactly what you'll read in the paper you'll read language space may not always be optimal for reasoning let's go okay yeah we got it and we want to utilize the last hidden state of the llm as a representation of the reasoning State when we say hidden state or latent space or embedding space or this sort of space of math and computation we're talking about the same space of course the the exact", "ee78c32e-e4d4-4236-8d85-f86704312de2": "of the reasoning State when we say hidden state or latent space or embedding space or this sort of space of math and computation we're talking about the same space of course the the exact state of the space changes depending on where we are in the Transformer but let's take a look at the image from the paper in a typical Chain of Thought reasoning model we're going to ask a question we're going to generate some tokens and we're going to think kind of out loud we're we're going to let the chains of thought flow when you click into the Chain of Thought on 01 as we've seen before you can see sort of in the side panel the the steps it's thinking through now conversely to actually thinking out loud we have here that the last hidden states are used as input embeddings okay well what does this mean well it let's go back to our gpt2 style diagram and think about this the input embeddings here are where we're essentially looping back to so what we do is we kind of loop back before we generate", "cd1e0eb3-2a4c-41cb-bfa9-41f08db0d656": "well it let's go back to our gpt2 style diagram and think about this the input embeddings here are where we're essentially looping back to so what we do is we kind of loop back before we generate the next token right back to this embedded space and and I'm basically GNA run through again before I give you the next token I'm going to keep chewing on it I'm going to keep thinking about it and this could be you know in gbt2 this was 12 different decoder block Stacks you can imagine a lot of different configurations and ways to do this but essentially what are we doing we're avoiding that compression by staying in the latent space okay we're avoiding that compression because of course when we do the actual prediction of the next token you know this is my little Transformer here this is from The Illustrated Transformer that also has an encoder and a decoder stack but the point here is to look at the next token prediction to realize this is the GPT style decoder stack and we are having an", "3a0371e5-040c-4f24-a799-ba26aff55127": "The Illustrated Transformer that also has an encoder and a decoder stack but the point here is to look at the next token prediction to realize this is the GPT style decoder stack and we are having an an actual compression there when we do that prediction to the word so we want to avoid that by using the hidden State representations and I also want you to note here we use these beginning of thinking end of thinking tokens remember we saw this mentioned earlier in the talk today by J Alamar because it's able to spend more time processing through the process of generating thinking tokens and explaining its Chain of Thought now if we look a little bit closer at the paper here we can see that we can actually you know put a language modeling head on each hidden State and decode and pop out the token but we don't okay because obviously that's kind of the point that we're not doing that and so it is more of a black box if we wanted it to be more explainable we would need to do more", "d838212b-696c-4b01-9260-5893c28d9d2e": "out the token but we don't okay because obviously that's kind of the point that we're not doing that and so it is more of a black box if we wanted it to be more explainable we would need to do more intermediate decod in so it's harder to know exactly what it's thinking and if you've been following our content a while this language modeling head you might notice from this you know widely now shared llm visualization this is just the very last step it's the very last piece before we actually do our next token prediction after we've done all of our embedding and Matrix multiplications with attention feed forward lay residuals add Norm layers Etc okay so take away from this big idea we don't need to use tokens directly coconut came in and they're like yep can do and that's pretty dope and it's pretty dope not just because a bunch of researchers got together and said can do it's pretty dope because it might actually be super useful in 2025 for real products for real people for industry", "ebbc96ae-cf77-412b-8dd1-08b5fb0e7b5a": "it's pretty dope not just because a bunch of researchers got together and said can do it's pretty dope because it might actually be super useful in 2025 for real products for real people for industry that gives us an entry point into the recurrent depth approach so let's go deeper Let's uh recur what we just actually did with coconut now let's talk about scaling test time compute with latent reasoning a recurrent depth approach this is from just a couple weeks ago February so now same idea not using language space using latent space and we're doing it via recurrent depth now the diagram from this paper that you need to check out that you need to know about is this one test time compute recurrence but I'll tell you right now this one might not help you truly understand what recurrent depth really is doing at a calculation level at test time the model can iterate longer to use more compute and improve its performance okay instead of scaling test time reasoning by verbalizing in long", "e2b1de1d-6d3e-4edb-b4b7-bca593a44b9f": "really is doing at a calculation level at test time the model can iterate longer to use more compute and improve its performance okay instead of scaling test time reasoning by verbalizing in long chains of thought the model improves entirely by reasoning in latent space so this was to uh I believe Richard Go's question earlier tasks that require less reasoning like open book QA conge quicker this is very cool than tasks which need more reasoning this is the key Insight from the paper the constraint that expensive internal reasoning must always be projected down to a single verbalized token appears wasteful it's plausible that models could be more competent if they were able to natively think in their own language of continuous latent space they are computers after all our proposed Transformer architecture is built upon a latent depth recurrent block that is run for a randomly sampled number of iterations during training I can't see it let's see what they gave us in the paper they gave", "1ba91381-5fe9-4f5c-a310-7c2b38218207": "architecture is built upon a latent depth recurrent block that is run for a randomly sampled number of iterations during training I can't see it let's see what they gave us in the paper they gave us this bad boy personally not a fan of this diagram whiz thinks it's totally fine and it makes perfect sense let's see if we can break it down for you guys here a visualization of the architecture we have the Prelude block we have the recurrent block recurrent block recurrent block and then this Koda so each block consists of a number of su layers okay the blue Prelude block embeds the input into latent space all right where the green shared recurrent block is a block of layers that is repeated to compute the final latent state which is decoded by the layers of the red Coda block back to our gp2 architecture diagram let's think about how we're still kind of doing this loop back we're still doing this reasoning in in space and now let's label the Prelude the recurrent block and the Koda we", "670951c6-4b63-48a9-82db-d43512bbfeb3": "architecture diagram let's think about how we're still kind of doing this loop back we're still doing this reasoning in in space and now let's label the Prelude the recurrent block and the Koda we want to think about the recurrent block as an entire block or stack this is the useful way to sort of take this to the next level and what we want to do is we want to imagine that now we're going to set this up so that we're going to put a bunch of recurrent blocks kind of in parallel recur to occur again right and we're going to set it up so it looks something like this we have a single Prelude we have one recurrent block we have two recurrent block we have n recurrent block and then we get a single Koda or output you can configure this as whiz will show you in the code many different ways and this is the big idea and it's a natural extension sort of depthwise to what we saw with coconut so the big idea here is that you don't need to use tokens directly same big idea as coconut recurrent", "0a51141d-546a-461a-ad5c-a4ab234650c7": "this is the big idea and it's a natural extension sort of depthwise to what we saw with coconut so the big idea here is that you don't need to use tokens directly same big idea as coconut recurrent depth says just like coconut yeah we can do it and and maybe maybe maybe maybe it could even be more efficient especially with tasks that require less reasoning like open book QA converge quicker observations we can hypothesize that maybe just maybe uh we could scale this out and we could we could be like I don't know better faster and cheaper Wiz I want to bring you up to talk a little bit about takeaways before we get into the demo here so uh is is then recurrent is the recurrent depth approach just better then now like is that is that the is it just the next step I mean what's your what's your take on this yeah I mean so no not better uh it's definitely different it's definitely uh you know do it's trying to do a different thing which is dope I would say like at the end of the day uh", "fbc1100b-d806-4090-88b7-cd8a8011e398": "your take on this yeah I mean so no not better uh it's definitely different it's definitely uh you know do it's trying to do a different thing which is dope I would say like at the end of the day uh they're they're using the same process but they're they're they're finding different ways to uh to take advantage of that process uh the recurrent depth is more of an architecture change right it's more of a let's actually get this reasoning inherent to the to the model we're going to train it to be very good at this recurrent task we're going to train it to do this this accordion thing that it does very well right uh versus coconut which is like let's adapt and add to existing uh architecture right to to get this uh this kind of reasoning flavor that that coconut winds to get or winds up getting so it's it's it's a it's the same process two different approaches though where they're coming at it from two different angles uh I would say like current depth is uh is interesting because it's", "c44a13ee-3b19-438d-86cb-364d0ffcd29a": "so it's it's it's a it's the same process two different approaches though where they're coming at it from two different angles uh I would say like current depth is uh is interesting because it's got budget forcing right it's it's obviously designed to scale as you need it to uh however coconut you know is I mean it's great it's just Chain of Thought but inside the model right so that's right that's right both both good both definitely good uh I think we're we're just seeing these Laten space approaches kind of flourish right now and we I I expect that we will continue to see them flourish as we as we go on together yeah and this this is kind of interesting right like this was released but not by meta AI but by Facebook research right and and so the the recurrent depth approach was also done by researchers at Lawrence Livermore and elsewhere um this is not this not you know something that product teams are using today this is this is very much a research grade thing that is cool and", "6db27107-5ae4-4a9c-89e3-319f9baedcc7": "done by researchers at Lawrence Livermore and elsewhere um this is not this not you know something that product teams are using today this is this is very much a research grade thing that is cool and we're seeing some you know early signs that it's potentially quite useful um I I wanna I want to zoom in on on like just when people think about the the actual how of this when they think about actually implementing this in in maybe one of their applications so whereas in the Coconut space you're you're going to go and you're G to you're gonna like oh nope not going out into natural language space just going to sit here and chew on it chew on it chew on it and then I'm gonna pop out my final answer so all you get is final answer baby it's called a blackbox okay when we go to the recurrent depth piece um you said something interesting earlier when we were chatting about this and it was it was like I'm going to think and think and think and think and think and all of a sudden I know and I'm", "aefef0a4-667c-40a7-ab22-19f4fcdd6b80": "piece um you said something interesting earlier when we were chatting about this and it was it was like I'm going to think and think and think and think and think and all of a sudden I know and I'm going to do that just with one token is sort of the recurrent depth paper and then I'm going to let the rest of the tokens stream like normal right so so there's this real interesting idea of like which things are you thinking about and this is where the idea of a beginning of thinking end of thinking token or a beginning of sequence end of sequence token comes into play you can think about the sequence or you can think about the thinking is this does this make sense um yeah okay okay we can think about the thinking right so we can uh we can double we can double it up uh yeah we can think about the thing yeah yeah okay okay so so recurrent depth in short I mean is like you think about a single token and then you let the sequence go like that's what I thought was interesting and and maybe", "d87795a3-19d2-412e-8c7c-0fd2431bf9df": "the thing yeah yeah okay okay so so recurrent depth in short I mean is like you think about a single token and then you let the sequence go like that's what I thought was interesting and and maybe that's not exactly right but that was my understanding yeah I so that's not that's not yet not yet what's happening but the idea is that this is complimentary uh so the idea is that we have this these these and they call it out in the paper which is why we're bringing it up right uh but the the idea is that we have this uh complimentary uh Suite of scaling tools that shouldn't interfere with each other right that should allow us to uh to to go forward unimpeded and that's and that's the idea right so uh we can marry these methods together they're not yet married together right so we we still uh we still decode one output right we're not de decoding like a token at a time but you could certainly put this in a loop where it's going to think a lot about the next stage of thinking right so we", "ae747c85-7f02-4425-aadf-0253125e3fa0": "we still decode one output right we're not de decoding like a token at a time but you could certainly put this in a loop where it's going to think a lot about the next stage of thinking right so we can imagine like thinking through a process step by step we can blow those steps out and for each of those steps we can use recurrent depth blah blah blah there you go that's the idea yeah yeah so like a circumstance thing right right we don't have the circumstance yet for this to be a brilliant solution right we're not we're not we don't have so much compute that we could just that we could just do this willy-nilly yet but it's there it exists it's possible yeah I mean it reminds me of why we don't design like you know like hammers at the level of the atom right it's like it's like um you know we've got we've got sort of this idea may we could call it system one is GPT 40 mini and then we could say Okay reasoning model that's spitting out tokens is like is like system two and then maybe", "66c90907-4783-45c2-a156-b4edae39fc91": "we've got we've got sort of this idea may we could call it system one is GPT 40 mini and then we could say Okay reasoning model that's spitting out tokens is like is like system two and then maybe like we've got this sort of system three that's in in in latent space and then we've got this like system four that's like that's like you know On Any Given specific type of of of thing I might want to extra think about in latent space I might go deeper on it so so there's just this real sort of very interesting abstraction Ed meta thinking at play here and um and it gets back to me to sort of the idea of like kind of Meta Meta learning I mean they they really they really did away with our ability to use that term and in the gpt3 paper so um we're at the end of sort of the words that we that we can concretely say we know what to do but we know what to do with the code so I want to go ahead and just quickly introduce this to you uh whiz we're going to do a quick demo here and we're going to"}}